doom/config.org
#+title:    doom emacs config
#+date:     2022, Novemeber
#+author:   botak

* Emacs global
** Theme
#+begin_src emacs-lisp :config.el :comments link
(setq doom-theme 'doom-solarized-light)

(after! doom-themes
  (setq doom-themes-enable-bold t
        doom-themes-enable-italic t)
)
#+end_src

** Fonts
- italicising keywords is syntactic sugar and bloat, it leads to complexity and mental overhead -> we do not use it.
#+begin_src emacs-lisp :config.el :comments link
(setq doom-font (font-spec :family "Iosevka Nerd Font" :size 10)
      doom-big-font (font-spec :family "Iosevka Nerd Font" :size 16)
      doom-variable-pitch-font (font-spec :family "Iosevka Nerd Font" :size 12)
      doom-serif-font (font-spec :family "Iosevka Nerd Font" :size 12)
      doom-font-increment 1
      doom-big-font-increment 1)
#+end_src

** Emacs options
#+begin_src emacs-lisp :config.el :comments link
(xterm-mouse-mode t) ;; enable mouse
(setq mouse-wheel-progressive-speed nil
      mouse-wheel-follow-mouse 't
      scroll-preserve-screen-position t
      scroll-step 1)

(beacon-mode t)

(save-place-mode t)
(global-auto-revert-mode t)
(setq global-auto-revert-non-file-buffers t
      auto-save-default t)

(setq company-idle-delay 0.1  ;; do not set to 0 -> massive performance issues
      company-show-numbers t
      company-minimum-prefix-length 1)

(setq which-key-idle-delay 0.1 ;; do not set to 0 -> massive performance issues
      undo-limit 80000000
      browse-url-generic-program "firefox"
      rainbow-mode t
      x-stretch-cursor t)

(setq doom-scratch-initial-major-mode 'org-mode) ;; make scratch buffer be in org mode -> coding(with #+src) or notes
#+end_src

** Modeline
- no functionality that is already handeled by my os.
#+begin_src emacs-lisp :config.el :comments link
(display-time-mode nil)
(display-battery-mode nil)
(setq doom-modeline-height 15
      doom-modeline-bar-width 5
      doom-modeline-persp-name t
      display-battery-mode nil
      display-time-mode nil)
#+end_src

** editor options
- restrict text column width. then wrap words -> forces to not nest and keeps readability maximized
#+begin_src emacs-lisp :config.el :comments link
(whitespace-mode t) ;; hl whitespace
(global-subword-mode t)
(+global-word-wrap-mode t)

(setq hscroll-margin 10
      scroll-margin 10
      display-line-numbers-type 'absolute)

(setq evil-ex-substitute-global t
      evil-move-cursor-back t
      evil-kill-on-visual-paste nil)

(setq evil-snipe-scope 'visible
      evil-snipe-auto-scroll t
      evil-snipe-repeat-keys t)

(setq calc-angle-mode 'rad
      calc-symbolic-mode t)

(setq yas-triggers-in-field t)

#+end_src

** Windows & splits
- Unify the minibuffer windows to the bottem of the screen and makes them like a split and not floating in the middle of the screen.
- constrain popup-buffers, that normally split horizontally to vsplit.
#+begin_src emacs-lisp :config.el :comments link
(setq evil-vsplit-window-right t
      even-window-sizes 'width-only
      right-fringe-width 10
      window-combination-resize t)

(ivy-posframe-mode t)
(setq ivy-posframe-display-functions-alist
      '((swiper                     . ivy-posframe-display-at-point)
        (complete-symbol            . ivy-posframe-display-at-point)
        (counsel-M-x                . ivy-display-function-fallback)
        (counsel-esh-history        . ivy-posframe-display-at-window-center)
        (counsel-describe-function  . ivy-display-function-fallback)
        (counsel-describe-variable  . ivy-display-function-fallback)
        (counsel-find-file          . ivy-display-function-fallback)
        (counsel-recentf            . ivy-display-function-fallback)
        (counsel-register           . ivy-posframe-display-at-frame-bottom-window-center)
        (dmenu                      . ivy-posframe-display-at-frame-bottom-center)
        (nil                        . ivy-posframe-display))
      ivy-posframe-height-alist
      '((swiper . 50)
        (dmenu . 50)
        (t . 50)))

(setq +popup-defaults '(:side right :width 0.33 :quit nil :select ignore :ttl 5 :modeline t))
(set-popup-rules!
  '(("\\*.*"
     :side right
     :width 0.33 ;;'+popup-shrink-to-fit
     :quit nil)
    ))
#+end_src

* Keybindings
Each binding must have its modes explicitly defined. (not just once at the top of the list).
The map macro has the following states:
| symbol | name            | desc                                      |
|--------+-----------------+-------------------------------------------|
| :v     | (visual mode)   | after pressing 'v' -> visual selection    |
| :m     | (motion mode)   | when inside a motion, eg '2w'             |
| :i     | (insert mode)   | self explanatory                          |
| :o     | (operator mode) | when manipulating text obj, such as 'dap' |
| :r     | (replace mode)  | afeter pressing 'r'                       |
| :g     | (global mode)   | will most likely be overridden            |

** leader system
#+begin_src emacs-lisp :config.el :comments link
(setq doom-leader-key "SPC"
      doom-localleader-key ",") ;; hit <spc> twice

(map! :leader
      (:prefix "t"
               "l" 'doom/toggle-line-numbers
               "H" 'global-hl-line-mode
               "t" 'toggle-truncate-lines
               "C" 'global-company-mode
               "e" 'counsel-load-theme
               "S" 'toggle-line-spacing
               "n" 'org-num-mode
               "d" 'peep-dired
               "D" 'dired-view-file)
      (:prefix "i"
               "d" 'user-insert-todays-date
               "D" 'user-insert-any-date)
      ;; remove unused from leader menu
      "'" nil
      "`" nil
      "." nil
      "," nil
      "SPC" nil
      "/" nil
      ":" nil)
#+end_src

** Global navigation
#+begin_src emacs-lisp :config.el :comments link
(map!
 :map  'override
 :nvimore "M-j" 'evil-window-left
 :nvimore "M-k" 'evil-window-right
 :nvimore "M-s" 'evil-window-vsplit
 :nvimore "M-q" (lambda () (interactive) (evil-quit) (balance-windows))
 :nvimore "M-x" 'dired-jump
 :nvimore "M-f" 'counsel-fzf
 :nvimore "M-r" 'counsel-recentf
 :nvimore "M-h" '+lookup/documentation
 :nvimore "M-t" 'shell-command ;; t for terminal
 :nvimore "M-'" 'consult-bookmark
 :nvimore "M-=" (lambda () (interactive) (evil-window-increase-width 10))
 :nvimore "M--" (lambda () (interactive) (evil-window-decrease-width 10))
 :nvimore "M-/" '+default/search-project
 :nvimore "M-;" 'counsel-M-x
 :nvimore "C-c" 'evil-force-normal-state ;; if all else fails (remap Alt_l: Esc)
 :nvimore "C--" 'doom/decrease-font-size
 :nvimore "C-=" 'doom/increase-font-size
 :nvimore "C-0" 'doom/reset-font-size)

(map!
 :map evil-org-agenda-mode-map
 :nvimore "M-j" 'evil-window-prev
 :nvimore "M-k" 'evil-window-next
 :nvimore "M-s" 'evil-window-vsplit
 :nvimore "M-q" 'user-window-quit)
#+end_src

** Vim editing
- this might be very opinionated but i find this small superset to greatly enhance vim's functionality while (mostly) not creating any conflicting bindings.
- we need half page scrolling, because full page almost always ends up with the user still having to adjust with <jk>. If you need to find something outside of screen, use search. (scrolling by paragraph is bad because it is inconsistent)
- better orientation when jumping
- add a search key to 's' and 'S', so no more relative line jumping and then 'f' or 't' jumping inline. Instead just jump to the exact position you need to get to immediately without the mental overhead (of doing both steps).
- stay on the home row more with evilemotions on 'JKHL'
#+begin_src emacs-lisp :config.el :comments link
(setq evilem-keys '(?a ?o ?e ?u ?i ?d ?h ?t ?n ?s))
(map!
 :nvmo "C-u"   'user-scroll-half-up
 :nvmo "C-d"   'user-scroll-half-dn
 :nvmo "C-o"   (lambda () (interactive) (evil-jump-backward 1) (evil-scroll-line-to-center nil))
 :nvmo "C-i"   (lambda () (interactive) (evil-jump-forward 1) (evil-scroll-line-to-center nil))
 :nvmo "n"     (lambda () (interactive) (evil-ex-search-next 1) (evil-scroll-line-to-center nil))
 :nvmo "N"     (lambda () (interactive) (evil-ex-search-previous 1) (evil-scroll-line-to-center nil))
 :nvmo "U"     'evil-redo
 :nvmo "Q"     'evil-execute-last-recorded-macro
 :nvmo "J"     'evilem-motion-next-line
 :nvmo "K"     'evilem-motion-previous-line
 :nvmo "L"     'evil-end-of-line
 :nvmo "H"     'evil-first-non-blank
 :nvmo "+"     'evil-join)

;; override evil-snipe's 's' key with something better
(map!
 :map evil-snipe-local-mode-map
 :nm   "s"     'evilem-motion-find-char
 :nm   "S"     'evilem-motion-find-char-backward
 ;; in operator made no conflict with 'surround: s'
 :o    "z"     'evilem-motion-find-char
 :o    "Z"     'evilem-motion-find-char-backward)
#+end_src

