doom/config.org
** dired
#+begin_src emacs-lisp :config.el :comments link
(map! :map dired-mode-map
      :n "RET" 'dired-open-file
      :n "j" 'evil-next-line
      :n "k" 'evil-previous-line
      :n "f" 'dired-goto-file
      :n "h" 'dired-up-directory
      :n "l" 'dired-open-file
      :n "m" 'dired-mark
      :n "t" 'dired-toggle-marks
      :n "u" 'dired-unmark
      :n "y" 'dired-do-copy
      :n "r" 'dired-do-rename
      :n "d" 'dired-do-delete
      :n "T" 'dired-do-touch
      :n "x" 'dired-do-chmod
      :n "w" 'dired-do-chown
      :n "p" 'dired-do-print
      :n "y" 'dired-copy-filenamecopy-filename-as-kill
      :n "z" 'dired-do-compress
      :n "." 'dired-omit-mode
      :n "o" 'user-dired-order
      :n "s" 'dired-toggle-sudo
      (:prefix ("+" . "create")
       :n "f" 'dired-create-empty-file
       :n "d" 'dired-create-directory
       ))

(map! :map peep-dired-mode-map
      :n "j" 'peep-dired-next-file
      :n "k" 'peep-dired-prev-file)

(add-hook 'peep-dired-hook 'evil-normalize-keymaps)
#+end_src

** org-mode
#+begin_src emacs-lisp :config.el :comments link
(map!
 :map evil-org-mode-map
 :nvmo "L"     'evil-org-end-of-line
 :nvmo "H"     'evil-first-non-blank
 (:prefix "g"
  :n "j" 'org-next-visible-heading
  :n "k" 'org-previous-visible-heading))
#+end_src

* User functions
#+begin_src emacs-lisp :config.el :comments link
(defun user-insert-any-date (date)
  "Insert DATE using the current locale."
  (interactive (list (calendar-read-date)))
  (insert (calendar-date-string date)))

(defun user-insert-todays-date (prefix)
  (interactive "P")
  (let ((format (cond
                 ((not prefix) "%A, %B %d, %Y")
                 ((equal prefix '(4)) "%m-%d-%Y")
                 ((equal prefix '(16)) "%Y-%m-%d"))))
    (insert (format-time-string format))))

;; no; i did not make a typo, it really scrolls down like this
(defun user-scroll-half-dn ()
  (interactive)
  (scroll-up (/ (window-body-height) 2))
  (evil-scroll-line-to-center nil)
)

;; no; i did not make a typo, it really scrolls down like this
(defun user-scroll-half-up ()
  (interactive)
  (scroll-down (/ (window-body-height) 2))
  (evil-scroll-line-to-center nil)
)
#+end_src

* Dired
- add more files to "hidden files"
- open files with external programs when they have a specific extension
#+begin_src emacs-lisp :config.el :comments link
(setq dired-omit-files
      (rx (or (seq bol (? ".") "#")             ;; emacs autosave files
              (seq bol "." (not (any ".")))     ;; dot-files
              (seq "~" eol)                     ;; backup-files
              (seq bol "CVS" eol)               ;; CVS dirs
              )))

(setq dired-open-extensions '(
                              ("mkv"    .   "mpv")
                              ("mp4"    .   "mpv")
                              ("mp3"    .   "clementine")
                              ("gif"    .   "sxiv")
                              ("jpeg"   .   "sxiv")
                              ("jpg"    .   "sxiv")
                              ("png"    .   "sxiv")
                              ("pdf"    .   "zathura")
                              ("epub"   .   "zathura")
                              ))

(setq dired-recursive-copies (quote always)
      dired-recursive-deletes (quote top)
      global-auto-revert-non-file-buffers t
      )

(remove-hook 'dired-mode-hook #'all-the-icons-dired-mode) ;; icons are bloat and create mental overhead
#+end_src

* Org Mode
- I hate icons, symbols and emoji's: only thing they do is create unnecessary mental overhead and abstraction while making sure you look cringe while using them. I use org-modern to hide "ugly" org syntax such as "#+begin_src" in order to improve readeablity of the code.

** general options
#+begin_src emacs-lisp :config.el :comments link
(after! org
(add-hook 'org-mode-hook 'visual-line-mode)
(add-hook 'org-mode-hook 'org-indent-mode)
(add-hook 'org-mode-hook 'org-superstar-mode)
(add-hook 'org-mode-hook 'org-num-mode)
(add-hook 'org-mode-hook 'org-appear-mode)
(add-hook 'org-mode-hook 'visual-fill-column-mode)

  (setq org-directory "~/Org"
        org-archive-location "~/Archive/Org"
        org-use-property-inheritance t
        org-startup-with-inline-images t
        org-startup-indented t
        org-list-allow-alphabetical t
        org-tags-column 0
        org-fold-catch-invisible-edits 'smart
        org-export-headline-levels 5
        org-refile-use-outline-path 'file
        org-refile-allow-creating-parent-nodes 'confirm
        org-use-sub-superscripts '{})
(setq visual-fill-column-width 120
      visual-fill-column-center-text nil
      visual-fill-column-fringes-outside-margins t)
)

#+end_src

** org babel (literate programming)
#+begin_src emacs-lisp
(setq org-babel-default-header-args
      '((:session . "none")
        (:results . "replace")
        (:exports . "code")
        (:cache . "no")
        (:noweb . "no")
        (:hlines . "no")
        (:tangle . "no")
        (:comments . "link"))
        org-auto-tangle-default t
        org-src-window-setup 'current-window)
#+end_src

** log
#+begin_src emacs-lisp :config.el :comments link
(after! org
  (setq   org-log-done 'time
          org-log-repeat 'time
          org-log-into-drawer 'LOGBOOK))
#+end_src

** priority
#+begin_src emacs-lisp :config.el :comments link
(after! org
  (setq org-priority-highest ?1
        org-priority-lowest ?5
        org-priority-faces
        '((?1 . 'all-the-icons-red)
          (?2 . 'all-the-icons-orange)
          (?3 . 'all-the-icons-yellow)
          (?4 . 'all-the-icons-green)
          (?5 . 'all-the-icons-blue))))
#+end_src

** org agenda
#+begin_src emacs-lisp :config.el :comments link
(after! org
  (setq org-agenda-files '("~/Org")
        org-agenda-skip-scheduled-if-done t
        org-agenda-skip-deadline-if-done t
        org-agenda-include-deadlines t
        org-agenda-block-separator nil
        org-agenda-tags-column 0
        org-agenda-compact-blocks t
        org-agenda-show-future-repeats nil
        org-agenda-deadline-faces
        '((1.0 . error)
          (1.0 . org-warning)
          (0.5 . org-upcoming-deadline)
          (0.0 . org-upcoming-distant-deadline))
        org-deadline-warning-days 3))
#+end_src

** clock
#+begin_src emacs-lisp :config.el :comments link
(after! org
  (setq   org-clock-out-when-done t
          org-clock-persist t ;; Save the running clock and all clock history when exiting Emacs, load it on startup
          org-clock-into-drawer t))
#+end_src

** org roam
#+begin_src emacs-lisp :config.el :comments link
(after! org
  (setq   org-roam-directory "~/Notes"
          org-roam-dailies-directory "daily/" ;; relative to org roam-dir
          org-roam-completion-everywhere t
          org-auto-align-tags 0))
#+end_src

** Format org-buffers & symbols
#+begin_src emacs-lisp :config.el :comments link
(after! org
  (setq   org-pretty-entities t
          org-pretty-entities-include-sub-superscripts t
          org-ellipsis "..."
          org-num-max-level 3
          org-hide-leading-stars t
          org-appear-autoemphasis t
          org-appear-autosubmarkers t
          org-appear-autolinks nil
          org-hide-emphasis-markers t
          org-table-convert-region-max-lines 20000
          org-emphasis-alist
          '(("*" (bold))
            ("/" italic)
            ("_" underline)
            ("=" redd)
            ("~" code)
            ("+" (:strike-through t)))
          org-fontify-quote-and-verse-blocks t
          org-list-demote-modify-bullet '(("+" . "-") ("-" . "+") ("*" . "+") ("1." . "a."))
          org-superstar-headline-bullets-list '("◉" "●" "○" "◈" "◆" "◇" )
          org-superstar-prettify-item-bullets t
          org-superstar-item-bullet-alist '((?* . "•")
                                            (?- . "•")
                                            (?+ . "➤"))))
#+end_src

