doom/config.org
** Header styling
- make headers bigger, as if it was compiled down to a pdf already.
- no italics in the font anywhere, that just decreases legibility and serves no purpose other than sugary syntax.
#+begin_src emacs-lisp :config.el :comments link
(custom-set-faces!
  '(org-todo                :weight extra-bold :height 1.0)
  '(org-checkbox            :weight extra-bold :height 1.0)
  '(org-priority            :weight extra-bold :height 1.0)
  '(org-special-keyword     :weight normal     :height 1.0)
  '(org-drawer              :weight normal     :height 1.0)
  '(org-tag                 :weight normal     :height 1.0)
  '(org-date                :weight normal     :height 1.0)
  '(org-document-title      :weight ultra-bold :height 1.4)
  '(outline-1               :weight extra-bold :height 1.7)
  '(outline-2               :weight bold       :height 1.6)
  '(outline-3               :weight bold       :height 1.5)
  '(outline-4               :weight semi-bold  :height 1.4)
  '(outline-5               :weight semi-bold  :height 1.3)
  '(outline-6               :weight semi-bold  :height 1.2)
  '(outline-8               :weight semi-bold  :height 1.1)
  '(outline-9               :weight semi-bold  :height 1.0)
  '(org-level-1             :inherit outline-1 :height 1.0)
  '(org-level-2             :inherit outline-2 :height 1.0)
  '(org-level-3             :inherit outline-3 :height 1.0)
  '(org-level-4             :inherit outline-4 :height 1.0)
  '(org-level-5             :inherit outline-5 :height 1.0)
  '(org-level-6             :inherit outline-6 :height 1.0)
  '(org-level-7             :inherit outline-8 :height 1.0)
  '(org-level-8             :inherit outline-9 :height 1.0)
  '(markdown-header-face    :weight extra-bold :height 1.4)
  '(markdown-header-face-1  :weight extra-bold :height 1.3)
  '(markdown-header-face-2  :weight bold       :height 1.2)
  '(markdown-header-face-3  :weight bold       :height 1.1)
  '(markdown-header-face-4  :weight semi-bold  :height 1.1)
  '(markdown-header-face-5  :weight semi-bold  :height 1.1)
  '(markdown-header-face-6  :weight semi-bold  :height 1.1)
  '(markdown-header-face-7  :weight semi-bold  :height 1.1)
  '(markdown-header-face-8  :weight semi-bold  :height 1.1)
  )
#+end_src

** Tags
- used to group todos and headings together for filtering and viewing.
- These are organized after activity, not project
#+begin_src emacs-lisp :config.el :comments link
(after! org
  (setq org-tag-alist '(("EVENT" . ?e)
                        ("HABIT" . ?h)
                        ("WRITE" . ?w)
                        ("READ" . ?r)
                        ("STUDY" . ?s))))
#+end_src

** Todo states
| state | Description                                                                          |
|-------+--------------------------------------------------------------------------------------|
| TODO  | it's an item that needs addressing                                                   |
| PROG  | is being worked on and maybe needs to wait on something else to finish         |
| DELEG | someone else is doing it and I need to follow up with them                           |
| ASSIG | someone else has full, autonomous responsibility for it                              |
| CANC  | it's no longer necessary to finish                                                   |
| OPT   | optional means can be done after most important stuff is finished/may becom obsolete |
| DONE  | it's complete                                                                        |

#+begin_src emacs-lisp :config.el :comments link
(after! org
  (setq org-todo-keywords '((type
                             "TODO(t)"
                             "PROG(i)"
                             "OPT(o)"
                             "REVIEW(r)"
                             "WAIT(w)"
                             "|"
                             "DONE(d!)"
                             "CANC(C@)"
                             "DELEG(D@)"
                             "ASSIGN(a@)"))))
#+end_src

** capture templates
create templates for each of your projects, in my case: university, personal and work
agenda capture template is to capture all appointments centrally in your calendar. journal is for whatever, thoughts etc
#+begin_src emacs-lisp :config.el :comments link
(after! org
  (setq org-capture-templates
        '(("t" "TODO: personal"
           entry (file+headline "~/Org/personal_todo.org" "outstanding")
           "* TODO %? \n"
           :empty-lines 1)

          ("e" "EVENT: personal"
           entry (file+headline "~/Org/personal_agenda.org" "events")
           "* %? :EVENT: \nSCHEDULED: %^T \nLOCATION: \nMATERIAL:"
           :empty-lines 1)

          ("r" "EVENT(repeat): personal"
           entry (file+headline "~/Org/personal_agenda.org" "repeating")
           "* %? :EVENT: \nSCHEDULED: %^T \nLOCATION: \nMATERIAL:"
           :empty-lines 1)

          ("n" "NOTE: personal"
           entry (file "~/Org/personal_note.org")
           "* %?\n%U"
           :empty-lines 1)

          ("T" "TODO: work"
           entry (file+headline "~/Org/work_todo.org" "current")
           "* TODO %?\n"
           :empty-lines 1)

          ("E" "EVENT: work"
           entry (file+headline "~/Org/work_agenda.org" "events")
           "* %? :EVENT: \nSCHEDULED: %^T \nLOCATION: \nMATERIAL:"
           :empty-lines 1)

          ("R" "EVENT(repeat): work"
           entry (file+headline "~/Org/work_agenda.org" "repeating")
           "* %? :EVENT: \nSCHEDULED: %^T \nLOCATION: \nMATERIAL:"
           :empty-lines 1)

          ("N" "NOTE @work"
           entry (file "~/Org/work_note.org")
           "* %? \n%U"
           :empty-lines 1))))
#+end_src

** daily notes (journaling)
#+begin_src emacs-lisp :config.el :comments link
(setq org-roam-dailies-capture-templates
      '(("d" "default" entry
         (file "~/Notes/templates/daily_template.org")
         :target (file+head "%<%Y-%m-%d>.org"
                            "#+title:\t%<%Y-%m-%d>\n#+author:\temil lenz\n#+date:\t%<%Y-%m-%d>"))))
#+end_src
