doom/config.el

;; [[file:config.org::*Header styling][Header styling:1]]
(custom-set-faces!
  '(org-todo                :weight extra-bold :height 1.0)
  '(org-checkbox            :weight extra-bold :height 1.0)
  '(org-priority            :weight extra-bold :height 1.0)
  '(org-special-keyword     :weight normal     :height 1.0)
  '(org-drawer              :weight normal     :height 1.0)
  '(org-tag                 :weight normal     :height 1.0)
  '(org-date                :weight normal     :height 1.0)
  '(org-document-title      :weight ultra-bold :height 1.4)
  '(outline-1               :weight extra-bold :height 1.7)
  '(outline-2               :weight bold       :height 1.6)
  '(outline-3               :weight bold       :height 1.5)
  '(outline-4               :weight semi-bold  :height 1.4)
  '(outline-5               :weight semi-bold  :height 1.3)
  '(outline-6               :weight semi-bold  :height 1.2)
  '(outline-8               :weight semi-bold  :height 1.1)
  '(outline-9               :weight semi-bold  :height 1.0)
  '(org-level-1             :inherit outline-1 :height 1.0)
  '(org-level-2             :inherit outline-2 :height 1.0)
  '(org-level-3             :inherit outline-3 :height 1.0)
  '(org-level-4             :inherit outline-4 :height 1.0)
  '(org-level-5             :inherit outline-5 :height 1.0)
  '(org-level-6             :inherit outline-6 :height 1.0)
  '(org-level-7             :inherit outline-8 :height 1.0)
  '(org-level-8             :inherit outline-9 :height 1.0)
  '(markdown-header-face    :weight extra-bold :height 1.4)
  '(markdown-header-face-1  :weight extra-bold :height 1.3)
  '(markdown-header-face-2  :weight bold       :height 1.2)
  '(markdown-header-face-3  :weight bold       :height 1.1)
  '(markdown-header-face-4  :weight semi-bold  :height 1.1)
  '(markdown-header-face-5  :weight semi-bold  :height 1.1)
  '(markdown-header-face-6  :weight semi-bold  :height 1.1)
  '(markdown-header-face-7  :weight semi-bold  :height 1.1)
  '(markdown-header-face-8  :weight semi-bold  :height 1.1)
  )
;; Header styling:1 ends here

;; [[file:config.org::*Tags][Tags:1]]
(after! org
  (setq org-tag-alist '(("EVENT" . ?e)
                        ("HABIT" . ?h)
                        ("WRITE" . ?w)
                        ("READ" . ?r)
                        ("STUDY" . ?s))))
;; Tags:1 ends here

;; [[file:config.org::*Todo states][Todo states:1]]
(after! org
  (setq org-todo-keywords '((type
                             "TODO(t)"
                             "PROG(i)"
                             "OPT(o)"
                             "REVIEW(r)"
                             "WAIT(w)"
                             "|"
                             "DONE(d!)"
                             "CANC(C@)"
                             "DELEG(D@)"
                             "ASSIGN(a@)"))))
;; Todo states:1 ends here

;; [[file:config.org::*capture templates][capture templates:1]]
(after! org
  (setq org-capture-templates
        '(("t" "TODO: personal"
           entry (file+headline "~/Org/personal_todo.org" "outstanding")
           "* TODO %? \n"
           :empty-lines 1)

          ("e" "EVENT: personal"
           entry (file+headline "~/Org/personal_agenda.org" "events")
           "* %? :EVENT: \nSCHEDULED: %^T \nLOCATION: \nMATERIAL:"
           :empty-lines 1)

          ("r" "EVENT(repeat): personal"
           entry (file+headline "~/Org/personal_agenda.org" "repeating")
           "* %? :EVENT: \nSCHEDULED: %^T \nLOCATION: \nMATERIAL:"
           :empty-lines 1)

          ("n" "NOTE: personal"
           entry (file "~/Org/personal_note.org")
           "* %?\n%U"
           :empty-lines 1)

          ("T" "TODO: work"
           entry (file+headline "~/Org/work_todo.org" "current")
           "* TODO %?\n"
           :empty-lines 1)

          ("E" "EVENT: work"
           entry (file+headline "~/Org/work_agenda.org" "events")
           "* %? :EVENT: \nSCHEDULED: %^T \nLOCATION: \nMATERIAL:"
           :empty-lines 1)

          ("R" "EVENT(repeat): work"
           entry (file+headline "~/Org/work_agenda.org" "repeating")
           "* %? :EVENT: \nSCHEDULED: %^T \nLOCATION: \nMATERIAL:"
           :empty-lines 1)

          ("N" "NOTE @work"
           entry (file "~/Org/work_note.org")
           "* %? \n%U"
           :empty-lines 1))))
;; capture templates:1 ends here

;; [[file:config.org::*daily notes (journaling)][daily notes (journaling):1]]
(setq org-roam-dailies-capture-templates
      '(("d" "default" entry
         (file "~/Notes/templates/daily_template.org")
         :target (file+head "%<%Y-%m-%d>.org"
                            "#+title:\t%<%Y-%m-%d>\n#+author:\temil lenz\n#+date:\t%<%Y-%m-%d>"))))
;; daily notes (journaling):1 ends here
